Revit 2024 API
FamilyTypeSetIterator Class
An iterator to a FamilyType set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class FamilyTypeSetIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class FamilyTypeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class FamilyTypeSetIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyTypeSetIterator
See Also
FamilyTypeSetIterator Members
Autodesk.Revit.DB Namespace